Merge branch 'main' of https://github.com/weisyn/contract-sdk-go
